In [1]:
import numpy as np
import pandas as pd

In [6]:
baseball_games={'Team':['Lions','Hawks','Eagles','Marines','Fighters','Buffalos'],
               'Rank':[1,2,3,4,5,6],
               'Gamegap':['M3',1.0,7.5,9.0,12.5,15.0]}
pacific_ranking=pd.DataFrame(baseball_games)
pacific_ranking

       Team  Rank Gamegap
0     Lions     1      M3
1     Hawks     2       1
2    Eagles     3     7.5
3   Marines     4       9
4  Fighters     5    12.5
5  Buffalos     6      15

In [7]:
pacific_ranking[1:2]

    Team  Rank Gamegap
1  Hawks     2       1

In [8]:
population={'rank':[1,2,3,4,5],
            'Countries':['China','India','USA','Indneshia','Brazil'],
            'population':[1395.38,1334.22,327.35,264.16,208.33]}
store_here=pd.DataFrame(population)
store_here

   rank  Countries  population
0     1      China     1395.38
1     2      India     1334.22
2     3        USA      327.35
3     4  Indneshia      264.16
4     5     Brazil      208.33

In [9]:
store_here[1:2]

   rank Countries  population
1     2     India     1334.22

In [10]:
store_here.loc[1]

rank                2
Countries       India
population    1334.22
Name: 1, dtype: object

In [11]:
family=['Yuri','Keiko','Naoki','Takato']
age=[21,49,52,18]

arr=np.array([21,49,52,18])

d={'Yuri':21,'Keiko':49,'Naoki':52,'Takato':18}
d

{'Yuri': 21, 'Keiko': 49, 'Naoki': 52, 'Takato': 18}

In [12]:
pd.Series(d)

Yuri      21
Keiko     49
Naoki     52
Takato    18
dtype: int64

In [13]:
pd.Series(index=family,data=age)

Yuri      21
Keiko     49
Naoki     52
Takato    18
dtype: int64

In [14]:
pd.Series(arr)

0    21
1    49
2    52
3    18
dtype: int32

In [15]:
pd.Series(arr,family)

Yuri      21
Keiko     49
Naoki     52
Takato    18
dtype: int32

In [16]:
member=pd.Series(list('YURI'))
member

0    Y
1    U
2    R
3    I
dtype: object

In [17]:
Group1=pd.Series([7,3,4,5],index=['Freshman','Sophomore','Junior','Senior'])
Group1

Freshman     7
Sophomore    3
Junior       4
Senior       5
dtype: int64

In [18]:
Group2=pd.Series([4,3,5,6],index=['Freshman','Sophomore','Junior','Senior'])
Group2

Freshman     4
Sophomore    3
Junior       5
Senior       6
dtype: int64

In [19]:
Group1+Group2

Freshman     11
Sophomore     6
Junior        9
Senior       11
dtype: int64

In [20]:
Group1-Group2

Freshman     3
Sophomore    0
Junior      -1
Senior      -1
dtype: int64

In [21]:
GDP={'Country':['America','China','Japan','Germany'],
     'USD':[20494.05,13407.40,4971.93,4000.39,]}
gdp_world=pd.DataFrame(GDP)
gdp_world

   Country       USD
0  America  20494.05
1    China  13407.40
2    Japan   4971.93
3  Germany   4000.39

In [22]:
gdp_world[1:2]

  Country      USD
1   China  13407.4

In [23]:
yasukawa={'Name':['Naoki','Keiko','Yuri','Takato'],
       'Age':[52,49,21,18],
       'MorF':['M','F','M','F'],
       'Occupation':['Teacher','Nursery teacher','Student','Student']}
y_family=pd.DataFrame(yasukawa)
y_family

     Name  Age MorF       Occupation
0   Naoki   52    M          Teacher
1   Keiko   49    F  Nursery teacher
2    Yuri   21    M          Student
3  Takato   18    F          Student

31

           0                                    1
0       Flag                  Tiranga (Tricolour)
1     Emblem                 Sarnath Lion Capital
2   Language                      None[9][10][11]
3     Anthem                       Jana Gana Mana
4       Song                        Vande Mataram
5   Currency                     ₹ (Indian rupee)
6   Calendar                                 Saka
7     Animal  Tiger (land)River dolphin (aquatic)
8       Bird                       Indian peafowl
9     Flower                                Lotus
10     Fruit                                Mango
11      Tree                               Banyan
12     River                                Ganga
13      Game                    Not declared[226]

AttributeError: 'list' object has no attribute 'find'